# Multiple Conditionals
# ประเมินการเข้าเรียน/สิทธิ์สอบ

# คะแนนเข้าเรียนขั้นต่ำ 80
# คะแนนทำงานส่งขั้นต่ำ 60
# ต้องมีทั้งสองเงื่อนไขจึงจะมีสิทธิ์สอบ

attendance = int(input("คะแนนเข้าเรียน (0-100): "))
assignment = int(input("คะแนนส่งงาน (0-100): "))

# วิธี if ซ้อน if
'''
if attendance >= 80:
    if assignment >= 60:
        print("มีสิทธิ์สอบ")
    else:
        print("ไม่มีสิทธิ์สอบ เนื่องจากคะแนนส่งงานต่ำกว่า 60")
else:
    if assignment >= 60:
        print("ไม่มีสิทธิ์สอบ เนื่องจากคะแนนเข้าเรียนต่ำกว่า 80")
    else:
        print("ไม่มีสิทธิ์สอบ เนื่องจากคะแนนเข้าเรียนต่ำกว่า 80 และ คะแนนส่งงานต่ำกว่า 60")
'''

# วิธี and/or
if attendance >= 80 and assignment >= 60:
    print("มีสิทธิ์สอบ")
elif attendance < 80 and assignment >= 60:
    print("ไม่มีสิทธิ์สอบ เนื่องจากคะแนนเข้าเรียนต่ำกว่า 80")
elif attendance >= 80 and assignment < 60:
    print("ไม่มีสิทธิ์สอบ เนื่องจากคะแนนส่งงานต่ำกว่า 60")
else:
    print("ไม่มีสิทธิ์สอบ เนื่องจากคะแนนเข้าเรียนต่ำกว่า 80 และ คะแนนส่งงานต่ำกว่า 60")


'''
if attendance < 80 or assignment < 60:
    print("ไม่มีสิทธิ์สอบ")
else:
    print("มีสิทธิ์สอบ")
'''